{
  "ir_version": "0.1",
  "toolchain_version": "0.24.0",
  "ontology_source_file": "ontology/local/main.prophet",
  "ontology": {
    "id": "ont_commerce_local",
    "name": "commerce_local",
    "display_name": "Commerce Local",
    "version": "2.0.0",
    "description": "Commerce ontology for order creation, approval, and shipping."
  },
  "types": [
    {
      "id": "type_money",
      "name": "Money",
      "display_name": "Money",
      "kind": "custom",
      "base": "decimal",
      "constraints": {
        "min": "0.00"
      },
      "description": "Non-negative monetary amount used for order totals."
    }
  ],
  "objects": [
    {
      "id": "obj_order",
      "name": "Order",
      "display_name": "Order",
      "fields": [
        {
          "id": "fld_order_order_id",
          "name": "order_id",
          "display_name": "Order ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary",
          "description": "Stable order identifier."
        },
        {
          "id": "fld_order_customer",
          "name": "customer",
          "display_name": "Customer",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_user"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "User who placed the order."
        },
        {
          "id": "fld_order_total_amount",
          "name": "total_amount",
          "display_name": "Total Amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Total monetary amount associated with the order."
        },
        {
          "id": "fld_order_discount_code",
          "name": "discount_code",
          "display_name": "Discount Code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional promotional code applied to the order."
        },
        {
          "id": "fld_order_tags",
          "name": "tags",
          "display_name": "Tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          },
          "description": "Optional labels used to categorize the order."
        },
        {
          "id": "fld_order_shipping_address",
          "name": "shipping_address",
          "display_name": "Shipping Address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional destination address for order shipment."
        },
        {
          "id": "fld_order_approved_by_user_id",
          "name": "approved_by_user_id",
          "display_name": "Approved By User ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Identifier of the user who approved the order."
        },
        {
          "id": "fld_order_approval_notes",
          "name": "approval_notes",
          "display_name": "Approval Notes",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          },
          "description": "Optional notes recorded during order approval."
        },
        {
          "id": "fld_order_approval_reason",
          "name": "approval_reason",
          "display_name": "Approval Reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional reason captured for approving the order."
        },
        {
          "id": "fld_order_shipping_carrier",
          "name": "shipping_carrier",
          "display_name": "Shipping Carrier",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Carrier selected to deliver the order."
        },
        {
          "id": "fld_order_shipping_tracking_number",
          "name": "shipping_tracking_number",
          "display_name": "Shipping Tracking Number",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Tracking number assigned by the shipping carrier."
        },
        {
          "id": "fld_order_shipping_package_ids",
          "name": "shipping_package_ids",
          "display_name": "Shipping Package IDs",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          },
          "description": "Identifiers for packages included in the shipment."
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_order_order_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_order_created",
          "name": "created",
          "display_name": "Created",
          "initial": true,
          "description": "Initial state after an order is created."
        },
        {
          "id": "state_order_approved",
          "name": "approved",
          "display_name": "Approved",
          "initial": false,
          "description": "State entered after order approval is completed."
        },
        {
          "id": "state_order_shipped",
          "name": "shipped",
          "display_name": "Shipped",
          "initial": false,
          "description": "Final state when the order has been shipped."
        }
      ],
      "transitions": [
        {
          "id": "trans_order_approve",
          "name": "approve",
          "display_name": "Approve",
          "from_state_id": "state_order_created",
          "to_state_id": "state_order_approved",
          "description": "Transitions an order from created to approved."
        },
        {
          "id": "trans_order_ship",
          "name": "ship",
          "display_name": "Ship",
          "from_state_id": "state_order_approved",
          "to_state_id": "state_order_shipped",
          "description": "Transitions an order from approved to shipped."
        }
      ],
      "description": "Customer order aggregate."
    },
    {
      "id": "obj_user",
      "name": "User",
      "display_name": "User",
      "fields": [
        {
          "id": "fld_user_user_id",
          "name": "user_id",
          "display_name": "User ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary",
          "description": "Stable user identifier."
        },
        {
          "id": "fld_user_email",
          "name": "email",
          "display_name": "Email",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Email address used to contact and identify the user."
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_user_user_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": [],
      "description": "Platform user who can place or approve orders."
    }
  ],
  "structs": [
    {
      "id": "struct_address",
      "name": "Address",
      "display_name": "Address",
      "fields": [
        {
          "id": "fld_struct_address_line1",
          "name": "line1",
          "display_name": "Line 1",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Primary street line of the shipping address."
        },
        {
          "id": "fld_struct_address_city",
          "name": "city",
          "display_name": "City",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "City component of the shipping address."
        },
        {
          "id": "fld_struct_address_country_code",
          "name": "countryCode",
          "display_name": "Country Code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Country code for the shipping destination."
        }
      ],
      "description": "Postal address used for shipping destinations."
    },
    {
      "id": "struct_approval_context",
      "name": "ApprovalContext",
      "display_name": "Approval Context",
      "fields": [
        {
          "id": "fld_struct_approval_context_approver",
          "name": "approver",
          "display_name": "Approver",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_user"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Primary user reference responsible for approval."
        },
        {
          "id": "fld_struct_approval_context_watchers",
          "name": "watchers",
          "display_name": "Watchers",
          "type": {
            "kind": "list",
            "element": {
              "kind": "object_ref",
              "target_object_id": "obj_user"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          },
          "description": "Optional users who should receive approval visibility."
        },
        {
          "id": "fld_struct_approval_context_reason",
          "name": "reason",
          "display_name": "Reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional free-form reason attached to the context."
        }
      ],
      "description": "Supplemental context captured during order approval."
    }
  ],
  "action_inputs": [
    {
      "id": "ain_approve_order",
      "name": "Approve Order Command",
      "display_name": "Approve Order Command",
      "fields": [
        {
          "id": "fld_ain_approve_order_order",
          "name": "order",
          "display_name": "Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Order that should be approved."
        },
        {
          "id": "fld_ain_approve_order_approved_by",
          "name": "approvedBy",
          "display_name": "Approved By",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_user"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional user reference for who approved the order."
        },
        {
          "id": "fld_ain_approve_order_notes",
          "name": "notes",
          "display_name": "Notes",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          },
          "description": "Optional notes recorded as part of approval."
        },
        {
          "id": "fld_ain_approve_order_context",
          "name": "context",
          "display_name": "Context",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_approval_context"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional structured context for approval decisions."
        }
      ],
      "description": "Input payload for approving an order."
    },
    {
      "id": "ain_create_order",
      "name": "Create Order Command",
      "display_name": "Create Order Command",
      "fields": [
        {
          "id": "fld_ain_create_order_customer",
          "name": "customer",
          "display_name": "Customer",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_user"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Customer placing the order."
        },
        {
          "id": "fld_ain_create_order_total_amount",
          "name": "totalAmount",
          "display_name": "Total Amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Total monetary amount for the new order."
        },
        {
          "id": "fld_ain_create_order_discount_code",
          "name": "discountCode",
          "display_name": "Discount Code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional discount code applied during creation."
        },
        {
          "id": "fld_ain_create_order_tags",
          "name": "tags",
          "display_name": "Tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          },
          "description": "Optional labels assigned when creating the order."
        },
        {
          "id": "fld_ain_create_order_shipping_address",
          "name": "shippingAddress",
          "display_name": "Shipping Address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional shipping destination for the new order."
        }
      ],
      "description": "Input payload required to create a new order."
    },
    {
      "id": "ain_ship_order",
      "name": "Ship Order Command",
      "display_name": "Ship Order Command",
      "fields": [
        {
          "id": "fld_ain_ship_order_order",
          "name": "order",
          "display_name": "Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Approved order that will be shipped."
        },
        {
          "id": "fld_ain_ship_order_carrier",
          "name": "carrier",
          "display_name": "Carrier",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Carrier that will transport the shipment."
        },
        {
          "id": "fld_ain_ship_order_tracking_number",
          "name": "trackingNumber",
          "display_name": "Tracking Number",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Tracking number assigned to the shipment."
        },
        {
          "id": "fld_ain_ship_order_package_ids",
          "name": "packageIds",
          "display_name": "Package IDs",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          },
          "description": "Identifiers for packages included in the shipment."
        }
      ],
      "description": "Input payload required to ship an approved order."
    }
  ],
  "actions": [
    {
      "id": "act_approve_order",
      "name": "approveOrder",
      "display_name": "Approve Order",
      "kind": "process",
      "input_shape_id": "ain_approve_order",
      "output_event_id": "trans_order_approve",
      "description": "Approves an existing order."
    },
    {
      "id": "act_create_order",
      "name": "createOrder",
      "display_name": "Create Order",
      "kind": "process",
      "input_shape_id": "ain_create_order",
      "output_event_id": "aout_create_order",
      "description": "Creates a new order."
    },
    {
      "id": "act_ship_order",
      "name": "shipOrder",
      "display_name": "Ship Order",
      "kind": "workflow",
      "input_shape_id": "ain_ship_order",
      "output_event_id": "trans_order_ship",
      "description": "Ships an approved order."
    }
  ],
  "events": [
    {
      "id": "aout_create_order",
      "name": "Create Order Result",
      "display_name": "Create Order Result",
      "kind": "signal",
      "fields": [
        {
          "id": "fld_aout_create_order_order",
          "name": "order",
          "display_name": "Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Reference to the newly created order."
        }
      ],
      "description": "Result payload returned after creating an order."
    },
    {
      "id": "sig_payment_captured",
      "name": "PaymentCaptured",
      "display_name": "Payment Captured",
      "kind": "signal",
      "fields": [
        {
          "id": "fld_sig_payment_captured_order",
          "name": "order",
          "display_name": "Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Order associated with the captured payment."
        }
      ],
      "description": "Signal emitted when payment for an order is captured."
    },
    {
      "id": "trans_order_approve",
      "name": "OrderApproveTransition",
      "display_name": "Approve",
      "kind": "transition",
      "fields": [
        {
          "id": "trans_order_approve__pk__fld_order_order_id",
          "name": "order_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_order_approve__from_state",
          "name": "fromState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_order_approve__to_state",
          "name": "toState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_trans_order_approve_approved_by_user_id",
          "name": "approvedByUserId",
          "display_name": "Approved By User ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional approver identifier supplied with the transition."
        },
        {
          "id": "fld_trans_order_approve_note_count",
          "name": "noteCount",
          "display_name": "Note Count",
          "type": {
            "kind": "base",
            "name": "int"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Count of approval notes submitted for the order."
        },
        {
          "id": "fld_trans_order_approve_approval_reason",
          "name": "approvalReason",
          "display_name": "Approval Reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional reason supplied when approving the order."
        }
      ],
      "object_id": "obj_order",
      "transition_id": "trans_order_approve",
      "from_state_id": "state_order_created",
      "to_state_id": "state_order_approved",
      "description": "Transitions an order from created to approved."
    },
    {
      "id": "trans_order_ship",
      "name": "OrderShipTransition",
      "display_name": "Ship",
      "kind": "transition",
      "fields": [
        {
          "id": "trans_order_ship__pk__fld_order_order_id",
          "name": "order_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_order_ship__from_state",
          "name": "fromState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_order_ship__to_state",
          "name": "toState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_trans_order_ship_carrier",
          "name": "carrier",
          "display_name": "Carrier",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Carrier selected to transport the shipment."
        },
        {
          "id": "fld_trans_order_ship_tracking_number",
          "name": "trackingNumber",
          "display_name": "Tracking Number",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Shipment tracking number provided by the carrier."
        },
        {
          "id": "fld_trans_order_ship_package_ids",
          "name": "packageIds",
          "display_name": "Package IDs",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          },
          "description": "Identifiers for packages handed to the carrier."
        }
      ],
      "object_id": "obj_order",
      "transition_id": "trans_order_ship",
      "from_state_id": "state_order_approved",
      "to_state_id": "state_order_shipped",
      "description": "Transitions an order from approved to shipped."
    }
  ],
  "triggers": [
    {
      "id": "trg_on_order_approved",
      "name": "onOrderApproved",
      "display_name": "On Order Approved",
      "event_id": "trans_order_approve",
      "action_id": "act_ship_order",
      "description": "Invokes shipping when an order approval event is emitted."
    },
    {
      "id": "trg_on_payment_captured",
      "name": "onPaymentCaptured",
      "display_name": "On Payment Captured",
      "event_id": "sig_payment_captured",
      "action_id": "act_approve_order",
      "description": "Invokes order approval when payment capture is observed."
    }
  ],
  "query_contracts": [
    {
      "object_id": "obj_order",
      "object_name": "Order",
      "paths": {
        "list": "/orders",
        "get_by_id": "/orders/{id}",
        "typed_query": "/orders/query"
      },
      "pageable": {
        "supported": true,
        "default_size": 20
      },
      "filters": [
        {
          "field_id": "fld_order_approval_reason",
          "field_name": "approval_reason",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_approved_by_user_id",
          "field_name": "approved_by_user_id",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_customer",
          "field_name": "customer",
          "operators": [
            "eq",
            "in"
          ]
        },
        {
          "field_id": "fld_order_discount_code",
          "field_name": "discount_code",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_order_id",
          "field_name": "order_id",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_shipping_carrier",
          "field_name": "shipping_carrier",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_shipping_tracking_number",
          "field_name": "shipping_tracking_number",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_total_amount",
          "field_name": "total_amount",
          "operators": [
            "eq",
            "in",
            "gte",
            "lte"
          ]
        },
        {
          "field_id": "__state__",
          "field_name": "state",
          "operators": [
            "eq",
            "in"
          ]
        }
      ],
      "contract_hash": "835657e8a16077a44de3aefc9f788abb4e951c7c5049aa2a70105b7997cb9557"
    },
    {
      "object_id": "obj_user",
      "object_name": "User",
      "paths": {
        "list": "/users",
        "get_by_id": "/users/{id}",
        "typed_query": "/users/query"
      },
      "pageable": {
        "supported": true,
        "default_size": 20
      },
      "filters": [
        {
          "field_id": "fld_user_email",
          "field_name": "email",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_user_user_id",
          "field_name": "user_id",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        }
      ],
      "contract_hash": "94a173901b491822695755ca0a0ee03b8a8fb1d259dfce6a0b7d5f4eb6dbfd1c"
    }
  ],
  "generation_profile": {
    "golden_stack": "spring_boot"
  },
  "compatibility_profile": {
    "strict_enums": false,
    "list_scalar_shape_changes_are_breaking": true,
    "nested_list_shape_changes_are_breaking": true,
    "struct_field_contract_changes_are_breaking": true,
    "custom_type_constraint_changes_are_breaking": true
  },
  "query_contracts_version": "026cc621cb86c87effeb4d1c95d64d9f993c65869a205b9346d57dc90f5ad261",
  "ir_hash": "fa3659bcf9991b440f2a443a05e2c9ab4d6b253e4da4d89585cc7f27b352b6e4"
}
