{
  "ir_version": "0.1",
  "toolchain_version": "0.19.0",
  "ontology_source_file": "ontology/local/main.prophet",
  "ontology": {
    "id": "ont_support_local",
    "name": "support_local",
    "version": "1.0.0",
    "description": "Minimal support ontology used for Turtle target examples."
  },
  "types": [
    {
      "id": "type_email",
      "name": "Email",
      "kind": "custom",
      "base": "string",
      "constraints": {
        "pattern": "^[^@\\\\s]+@[^@\\\\s]+\\\\.[^@\\\\s]+$"
      }
    }
  ],
  "objects": [
    {
      "id": "obj_ticket",
      "name": "Ticket",
      "fields": [
        {
          "id": "fld_ticket_id",
          "name": "id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_ticket_title",
          "name": "title",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ticket_assignee",
          "name": "assignee",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_user_ref"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_ticket_tags",
          "name": "tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_ticket_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_ticket_new",
          "name": "New",
          "initial": true
        },
        {
          "id": "state_ticket_triaged",
          "name": "Triaged",
          "initial": false
        }
      ],
      "transitions": [
        {
          "id": "trans_ticket_triage",
          "name": "Triage",
          "from_state_id": "state_ticket_new",
          "to_state_id": "state_ticket_triaged"
        }
      ]
    }
  ],
  "structs": [
    {
      "id": "struct_user_ref",
      "name": "UserRef",
      "fields": [
        {
          "id": "fld_struct_user_ref_user_id",
          "name": "userId",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_user_ref_email",
          "name": "email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    }
  ],
  "action_inputs": [
    {
      "id": "ain_triage_ticket",
      "name": "TriageTicketCommand",
      "fields": [
        {
          "id": "fld_ain_triage_ticket_ticket",
          "name": "ticket",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_ticket"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    }
  ],
  "actions": [
    {
      "id": "act_triage_ticket",
      "name": "triageTicket",
      "kind": "process",
      "input_shape_id": "ain_triage_ticket",
      "output_event_id": "aout_triage_ticket"
    }
  ],
  "events": [
    {
      "id": "aout_triage_ticket",
      "name": "TriageTicketResult",
      "kind": "signal",
      "fields": [
        {
          "id": "fld_aout_triage_ticket_ticket",
          "name": "ticket",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_ticket"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_aout_triage_ticket_new_state",
          "name": "newState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "sig_ticket_created",
      "name": "TicketCreated",
      "kind": "signal",
      "fields": [
        {
          "id": "fld_sig_ticket_created_ticket",
          "name": "ticket",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_ticket"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "trans_ticket_triage",
      "name": "TicketTriageTransition",
      "kind": "transition",
      "fields": [
        {
          "id": "trans_ticket_triage__pk__fld_ticket_id",
          "name": "id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_ticket_triage__from_state",
          "name": "fromState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_ticket_triage__to_state",
          "name": "toState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "object_id": "obj_ticket",
      "transition_id": "trans_ticket_triage",
      "from_state_id": "state_ticket_new",
      "to_state_id": "state_ticket_triaged"
    }
  ],
  "triggers": [
    {
      "id": "trg_on_ticket_created",
      "name": "onTicketCreated",
      "event_id": "sig_ticket_created",
      "action_id": "act_triage_ticket"
    }
  ],
  "query_contracts": [
    {
      "object_id": "obj_ticket",
      "object_name": "Ticket",
      "paths": {
        "list": "/tickets",
        "get_by_id": "/tickets/{id}",
        "typed_query": "/tickets/query"
      },
      "pageable": {
        "supported": true,
        "default_size": 20
      },
      "filters": [
        {
          "field_id": "fld_ticket_id",
          "field_name": "id",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_ticket_title",
          "field_name": "title",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "__state__",
          "field_name": "state",
          "operators": [
            "eq",
            "in"
          ]
        }
      ],
      "contract_hash": "4b36f249ed2ae0b6c61056a78462de56613890ba2f8a60c74a91bb97607284d9"
    }
  ],
  "generation_profile": {
    "golden_stack": "spring_boot"
  },
  "compatibility_profile": {
    "strict_enums": false,
    "list_scalar_shape_changes_are_breaking": true,
    "nested_list_shape_changes_are_breaking": true,
    "struct_field_contract_changes_are_breaking": true,
    "custom_type_constraint_changes_are_breaking": true
  },
  "query_contracts_version": "fa69e4300b3d10c42435b689a584fc0d9713d0fa7137130dda42950aac6ef377",
  "ir_hash": "b2f8d0c5773066b38810dfa05dfa3176fd9be983aeafd00c5239ebc0655d5527"
}
