{
  "ir_version": "0.1",
  "toolchain_version": "0.24.0",
  "ontology_source_file": "ontology/local/main.prophet",
  "ontology": {
    "id": "ont_support_local",
    "name": "support_local",
    "display_name": "Support Local",
    "version": "2.0.0",
    "description": "Minimal support ontology used for Turtle target examples."
  },
  "types": [
    {
      "id": "type_email",
      "name": "Email",
      "display_name": "Email",
      "kind": "custom",
      "base": "string",
      "constraints": {
        "pattern": "^[^@\\\\s]+@[^@\\\\s]+\\\\.[^@\\\\s]+$"
      },
      "description": "Email address value validated by a lightweight format pattern."
    }
  ],
  "objects": [
    {
      "id": "obj_ticket",
      "name": "Ticket",
      "display_name": "Ticket",
      "fields": [
        {
          "id": "fld_ticket_id",
          "name": "id",
          "display_name": "ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary",
          "description": "Stable ticket identifier."
        },
        {
          "id": "fld_ticket_title",
          "name": "title",
          "display_name": "Title",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Short summary describing the support issue."
        },
        {
          "id": "fld_ticket_assignee",
          "name": "assignee",
          "display_name": "Assignee",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_user_ref"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional assignee details for the user handling the ticket."
        },
        {
          "id": "fld_ticket_tags",
          "name": "tags",
          "display_name": "Tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          },
          "description": "Optional labels used to categorize or filter tickets."
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_ticket_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_ticket_new",
          "name": "New",
          "display_name": "New",
          "initial": true,
          "description": "Initial lifecycle state before triage occurs."
        },
        {
          "id": "state_ticket_triaged",
          "name": "Triaged",
          "display_name": "Triaged",
          "initial": false,
          "description": "Lifecycle state after the ticket has been triaged."
        }
      ],
      "transitions": [
        {
          "id": "trans_ticket_triage",
          "name": "Triage",
          "display_name": "Triage",
          "from_state_id": "state_ticket_new",
          "to_state_id": "state_ticket_triaged",
          "description": "Moves a ticket from New to Triaged."
        }
      ],
      "description": "Support request tracked through a minimal triage lifecycle."
    }
  ],
  "structs": [
    {
      "id": "struct_user_ref",
      "name": "UserRef",
      "display_name": "User Ref",
      "fields": [
        {
          "id": "fld_struct_user_ref_user_id",
          "name": "userId",
          "display_name": "User ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Stable user identifier for the referenced assignee."
        },
        {
          "id": "fld_struct_user_ref_email",
          "name": "email",
          "display_name": "Email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          },
          "description": "Optional email address for contacting the assignee."
        }
      ],
      "description": "Lightweight user identity details used for ticket assignment."
    }
  ],
  "action_inputs": [
    {
      "id": "ain_triage_ticket",
      "name": "Triage Ticket Command",
      "display_name": "Triage Ticket Command",
      "fields": [
        {
          "id": "fld_ain_triage_ticket_ticket",
          "name": "ticket",
          "display_name": "Ticket",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_ticket"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Reference to the ticket that should be triaged."
        }
      ],
      "description": "Input payload identifying which ticket to triage."
    }
  ],
  "actions": [
    {
      "id": "act_triage_ticket",
      "name": "triageTicket",
      "display_name": "Triage Ticket",
      "kind": "process",
      "input_shape_id": "ain_triage_ticket",
      "output_event_id": "aout_triage_ticket",
      "description": "Runs ticket triage and returns the updated ticket state."
    }
  ],
  "events": [
    {
      "id": "aout_triage_ticket",
      "name": "Triage Ticket Result",
      "display_name": "Triage Ticket Result",
      "kind": "signal",
      "fields": [
        {
          "id": "fld_aout_triage_ticket_ticket",
          "name": "ticket",
          "display_name": "Ticket",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_ticket"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Reference to the ticket after triage processing."
        },
        {
          "id": "fld_aout_triage_ticket_new_state",
          "name": "newState",
          "display_name": "New State",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "State name assigned to the ticket after triage."
        }
      ],
      "description": "Result payload with the triaged ticket and resulting state."
    },
    {
      "id": "sig_ticket_created",
      "name": "TicketCreated",
      "display_name": "Ticket Created",
      "kind": "signal",
      "fields": [
        {
          "id": "fld_sig_ticket_created_ticket",
          "name": "ticket",
          "display_name": "Ticket",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_ticket"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "description": "Reference to the newly created ticket."
        }
      ],
      "description": "Event emitted when a new ticket is created."
    },
    {
      "id": "trans_ticket_triage",
      "name": "TicketTriageTransition",
      "display_name": "Triage",
      "kind": "transition",
      "fields": [
        {
          "id": "trans_ticket_triage__pk__fld_ticket_id",
          "name": "id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_ticket_triage__from_state",
          "name": "fromState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_ticket_triage__to_state",
          "name": "toState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "object_id": "obj_ticket",
      "transition_id": "trans_ticket_triage",
      "from_state_id": "state_ticket_new",
      "to_state_id": "state_ticket_triaged",
      "description": "Moves a ticket from New to Triaged."
    }
  ],
  "triggers": [
    {
      "id": "trg_on_ticket_created",
      "name": "onTicketCreated",
      "display_name": "On Ticket Created",
      "event_id": "sig_ticket_created",
      "action_id": "act_triage_ticket",
      "description": "Starts triage when the TicketCreated event is observed."
    }
  ],
  "query_contracts": [
    {
      "object_id": "obj_ticket",
      "object_name": "Ticket",
      "paths": {
        "list": "/tickets",
        "get_by_id": "/tickets/{id}",
        "typed_query": "/tickets/query"
      },
      "pageable": {
        "supported": true,
        "default_size": 20
      },
      "filters": [
        {
          "field_id": "fld_ticket_id",
          "field_name": "id",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_ticket_title",
          "field_name": "title",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "__state__",
          "field_name": "state",
          "operators": [
            "eq",
            "in"
          ]
        }
      ],
      "contract_hash": "4b36f249ed2ae0b6c61056a78462de56613890ba2f8a60c74a91bb97607284d9"
    }
  ],
  "generation_profile": {
    "golden_stack": "spring_boot"
  },
  "compatibility_profile": {
    "strict_enums": false,
    "list_scalar_shape_changes_are_breaking": true,
    "nested_list_shape_changes_are_breaking": true,
    "struct_field_contract_changes_are_breaking": true,
    "custom_type_constraint_changes_are_breaking": true
  },
  "query_contracts_version": "fa69e4300b3d10c42435b689a584fc0d9713d0fa7137130dda42950aac6ef377",
  "ir_hash": "749eaaffd12fb40bf34fd2579421cdec07f7312bf26c939c7e72dce5e9a90007"
}
