{
  "ir_version": "0.1",
  "toolchain_version": "0.20.0",
  "ontology_source_file": "ontology/local/main.prophet",
  "ontology": {
    "id": "ont_commerce_local",
    "name": "commerce_local",
    "version": "1.0.0",
    "description": "Commerce ontology for order creation, approval, and shipping."
  },
  "types": [
    {
      "id": "type_money",
      "name": "Money",
      "kind": "custom",
      "base": "decimal",
      "constraints": {
        "min": "0.00"
      }
    }
  ],
  "objects": [
    {
      "id": "obj_order",
      "name": "Order",
      "fields": [
        {
          "id": "fld_order_order_id",
          "name": "order_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary",
          "description": "Stable order identifier."
        },
        {
          "id": "fld_order_customer",
          "name": "customer",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_user"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_order_total_amount",
          "name": "total_amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_order_discount_code",
          "name": "discount_code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_order_tags",
          "name": "tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        },
        {
          "id": "fld_order_shipping_address",
          "name": "shipping_address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_order_approved_by_user_id",
          "name": "approved_by_user_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_order_approval_notes",
          "name": "approval_notes",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        },
        {
          "id": "fld_order_approval_reason",
          "name": "approval_reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_order_shipping_carrier",
          "name": "shipping_carrier",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_order_shipping_tracking_number",
          "name": "shipping_tracking_number",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_order_shipping_package_ids",
          "name": "shipping_package_ids",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_order_order_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_order_created",
          "name": "created",
          "initial": true
        },
        {
          "id": "state_order_approved",
          "name": "approved",
          "initial": false
        },
        {
          "id": "state_order_shipped",
          "name": "shipped",
          "initial": false
        }
      ],
      "transitions": [
        {
          "id": "trans_order_approve",
          "name": "approve",
          "from_state_id": "state_order_created",
          "to_state_id": "state_order_approved"
        },
        {
          "id": "trans_order_ship",
          "name": "ship",
          "from_state_id": "state_order_approved",
          "to_state_id": "state_order_shipped"
        }
      ],
      "description": "Customer order aggregate."
    },
    {
      "id": "obj_user",
      "name": "User",
      "fields": [
        {
          "id": "fld_user_user_id",
          "name": "user_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary",
          "description": "Stable user identifier."
        },
        {
          "id": "fld_user_email",
          "name": "email",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_user_user_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": [],
      "description": "Platform user who can place or approve orders."
    }
  ],
  "structs": [
    {
      "id": "struct_address",
      "name": "Address",
      "fields": [
        {
          "id": "fld_struct_address_line1",
          "name": "line1",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_city",
          "name": "city",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_country_code",
          "name": "countryCode",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_approval_context",
      "name": "ApprovalContext",
      "fields": [
        {
          "id": "fld_struct_approval_context_approver",
          "name": "approver",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_user"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_approval_context_watchers",
          "name": "watchers",
          "type": {
            "kind": "list",
            "element": {
              "kind": "object_ref",
              "target_object_id": "obj_user"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        },
        {
          "id": "fld_struct_approval_context_reason",
          "name": "reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    }
  ],
  "action_inputs": [
    {
      "id": "ain_approve_order",
      "name": "ApproveOrderCommand",
      "fields": [
        {
          "id": "fld_ain_approve_order_order",
          "name": "order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_approve_order_approved_by",
          "name": "approvedBy",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_user"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_ain_approve_order_notes",
          "name": "notes",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        },
        {
          "id": "fld_ain_approve_order_context",
          "name": "context",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_approval_context"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ],
      "description": "Input payload for approving an order."
    },
    {
      "id": "ain_create_order",
      "name": "CreateOrderCommand",
      "fields": [
        {
          "id": "fld_ain_create_order_customer",
          "name": "customer",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_user"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_order_total_amount",
          "name": "totalAmount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_order_discount_code",
          "name": "discountCode",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_order_tags",
          "name": "tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        },
        {
          "id": "fld_ain_create_order_shipping_address",
          "name": "shippingAddress",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_ship_order",
      "name": "ShipOrderCommand",
      "fields": [
        {
          "id": "fld_ain_ship_order_order",
          "name": "order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_ship_order_carrier",
          "name": "carrier",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_ship_order_tracking_number",
          "name": "trackingNumber",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_ship_order_package_ids",
          "name": "packageIds",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        }
      ]
    }
  ],
  "actions": [
    {
      "id": "act_approve_order",
      "name": "approveOrder",
      "kind": "process",
      "input_shape_id": "ain_approve_order",
      "output_event_id": "trans_order_approve",
      "description": "Approves an existing order."
    },
    {
      "id": "act_create_order",
      "name": "createOrder",
      "kind": "process",
      "input_shape_id": "ain_create_order",
      "output_event_id": "aout_create_order",
      "description": "Creates a new order."
    },
    {
      "id": "act_ship_order",
      "name": "shipOrder",
      "kind": "workflow",
      "input_shape_id": "ain_ship_order",
      "output_event_id": "trans_order_ship",
      "description": "Ships an approved order."
    }
  ],
  "events": [
    {
      "id": "aout_create_order",
      "name": "CreateOrderResult",
      "kind": "signal",
      "fields": [
        {
          "id": "fld_aout_create_order_order",
          "name": "order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "sig_payment_captured",
      "name": "PaymentCaptured",
      "kind": "signal",
      "fields": [
        {
          "id": "fld_sig_payment_captured_order",
          "name": "order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "trans_order_approve",
      "name": "OrderApproveTransition",
      "kind": "transition",
      "fields": [
        {
          "id": "trans_order_approve__pk__fld_order_order_id",
          "name": "order_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_order_approve__from_state",
          "name": "fromState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_order_approve__to_state",
          "name": "toState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_trans_order_approve_approved_by_user_id",
          "name": "approvedByUserId",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_trans_order_approve_note_count",
          "name": "noteCount",
          "type": {
            "kind": "base",
            "name": "int"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_trans_order_approve_approval_reason",
          "name": "approvalReason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ],
      "object_id": "obj_order",
      "transition_id": "trans_order_approve",
      "from_state_id": "state_order_created",
      "to_state_id": "state_order_approved"
    },
    {
      "id": "trans_order_ship",
      "name": "OrderShipTransition",
      "kind": "transition",
      "fields": [
        {
          "id": "trans_order_ship__pk__fld_order_order_id",
          "name": "order_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_order_ship__from_state",
          "name": "fromState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "trans_order_ship__to_state",
          "name": "toState",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_trans_order_ship_carrier",
          "name": "carrier",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_trans_order_ship_tracking_number",
          "name": "trackingNumber",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_trans_order_ship_package_ids",
          "name": "packageIds",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        }
      ],
      "object_id": "obj_order",
      "transition_id": "trans_order_ship",
      "from_state_id": "state_order_approved",
      "to_state_id": "state_order_shipped"
    }
  ],
  "triggers": [
    {
      "id": "trg_on_order_approved",
      "name": "onOrderApproved",
      "event_id": "trans_order_approve",
      "action_id": "act_ship_order"
    },
    {
      "id": "trg_on_payment_captured",
      "name": "onPaymentCaptured",
      "event_id": "sig_payment_captured",
      "action_id": "act_approve_order"
    }
  ],
  "query_contracts": [
    {
      "object_id": "obj_order",
      "object_name": "Order",
      "paths": {
        "list": "/orders",
        "get_by_id": "/orders/{id}",
        "typed_query": "/orders/query"
      },
      "pageable": {
        "supported": true,
        "default_size": 20
      },
      "filters": [
        {
          "field_id": "fld_order_approval_reason",
          "field_name": "approval_reason",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_approved_by_user_id",
          "field_name": "approved_by_user_id",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_customer",
          "field_name": "customer",
          "operators": [
            "eq",
            "in"
          ]
        },
        {
          "field_id": "fld_order_discount_code",
          "field_name": "discount_code",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_order_id",
          "field_name": "order_id",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_shipping_carrier",
          "field_name": "shipping_carrier",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_shipping_tracking_number",
          "field_name": "shipping_tracking_number",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_order_total_amount",
          "field_name": "total_amount",
          "operators": [
            "eq",
            "in",
            "gte",
            "lte"
          ]
        },
        {
          "field_id": "__state__",
          "field_name": "state",
          "operators": [
            "eq",
            "in"
          ]
        }
      ],
      "contract_hash": "835657e8a16077a44de3aefc9f788abb4e951c7c5049aa2a70105b7997cb9557"
    },
    {
      "object_id": "obj_user",
      "object_name": "User",
      "paths": {
        "list": "/users",
        "get_by_id": "/users/{id}",
        "typed_query": "/users/query"
      },
      "pageable": {
        "supported": true,
        "default_size": 20
      },
      "filters": [
        {
          "field_id": "fld_user_email",
          "field_name": "email",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        },
        {
          "field_id": "fld_user_user_id",
          "field_name": "user_id",
          "operators": [
            "eq",
            "in",
            "contains"
          ]
        }
      ],
      "contract_hash": "94a173901b491822695755ca0a0ee03b8a8fb1d259dfce6a0b7d5f4eb6dbfd1c"
    }
  ],
  "generation_profile": {
    "golden_stack": "spring_boot"
  },
  "compatibility_profile": {
    "strict_enums": false,
    "list_scalar_shape_changes_are_breaking": true,
    "nested_list_shape_changes_are_breaking": true,
    "struct_field_contract_changes_are_breaking": true,
    "custom_type_constraint_changes_are_breaking": true
  },
  "query_contracts_version": "026cc621cb86c87effeb4d1c95d64d9f993c65869a205b9346d57dc90f5ad261",
  "ir_hash": "11d80de956863e05d45fcd958134a99237823d4ea06eda6a385379796c72e0e7"
}
