{
  "ir_version": "0.1",
  "toolchain_version": "0.22.0",
  "ontology_source_file": "ontology/local/main.prophet",
  "ontology": {
    "id": "ont_artisan_bakery_local",
    "name": "artisan_bakery_local",
    "display_name": "Artisan Bakery Local",
    "version": "1.0.0",
    "description": "Operations ontology for a neighborhood bakery: catalog, customers, inventory, purchasing, invoicing, and fulfillment."
  },
  "types": [
    {
      "id": "type_currency_code",
      "name": "CurrencyCode",
      "display_name": "Currency Code",
      "kind": "custom",
      "base": "string",
      "constraints": {
        "pattern": "^[A-Z]{3}$"
      }
    },
    {
      "id": "type_email",
      "name": "Email",
      "display_name": "Email",
      "kind": "custom",
      "base": "string",
      "constraints": {
        "pattern": "^[^@\\\\s]+@[^@\\\\s]+\\\\.[^@\\\\s]+$"
      }
    },
    {
      "id": "type_money",
      "name": "Money",
      "display_name": "Money",
      "kind": "custom",
      "base": "decimal",
      "constraints": {
        "min": "0.00"
      }
    },
    {
      "id": "type_phone_number",
      "name": "PhoneNumber",
      "display_name": "Phone Number",
      "kind": "custom",
      "base": "string",
      "constraints": {
        "pattern": "^\\\\+?[0-9][0-9\\\\- ]{7,19}$"
      }
    },
    {
      "id": "type_quantity",
      "name": "Quantity",
      "display_name": "Quantity",
      "kind": "custom",
      "base": "decimal",
      "constraints": {
        "min": "0.00"
      }
    }
  ],
  "objects": [
    {
      "id": "obj_customer",
      "name": "Customer",
      "display_name": "Customer",
      "fields": [
        {
          "id": "fld_customer_customer_id",
          "name": "customer_id",
          "display_name": "Customer ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_customer_full_name",
          "name": "full_name",
          "display_name": "Full Name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_customer_email",
          "name": "email",
          "display_name": "Email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_phone",
          "name": "phone",
          "display_name": "Phone",
          "type": {
            "kind": "custom",
            "target_type_id": "type_phone_number"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_billing_address",
          "name": "billing_address",
          "display_name": "Billing Address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_shipping_address",
          "name": "shipping_address",
          "display_name": "Shipping Address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_preferred_currency",
          "name": "preferred_currency",
          "display_name": "Preferred Currency",
          "type": {
            "kind": "custom",
            "target_type_id": "type_currency_code"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_loyalty_points",
          "name": "loyalty_points",
          "display_name": "Loyalty Points",
          "type": {
            "kind": "base",
            "name": "int"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_tags",
          "name": "tags",
          "display_name": "Tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_customer_customer_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_delivery",
      "name": "Delivery",
      "display_name": "Delivery",
      "fields": [
        {
          "id": "fld_delivery_delivery_id",
          "name": "delivery_id",
          "display_name": "Delivery ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_delivery_sales_order",
          "name": "sales_order",
          "display_name": "Sales Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_destination",
          "name": "destination",
          "display_name": "Destination",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_carrier",
          "name": "carrier",
          "display_name": "Carrier",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_tracking_number",
          "name": "tracking_number",
          "display_name": "Tracking Number",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_scheduled_for",
          "name": "scheduled_for",
          "display_name": "Scheduled For",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_delivered_at",
          "name": "delivered_at",
          "display_name": "Delivered At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_status_text",
          "name": "status_text",
          "display_name": "Status Text",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_delivery_delivery_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_employee",
      "name": "Employee",
      "display_name": "Employee",
      "fields": [
        {
          "id": "fld_employee_employee_id",
          "name": "employee_id",
          "display_name": "Employee ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_employee_full_name",
          "name": "full_name",
          "display_name": "Full Name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_employee_email",
          "name": "email",
          "display_name": "Email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_employee_phone",
          "name": "phone",
          "display_name": "Phone",
          "type": {
            "kind": "custom",
            "target_type_id": "type_phone_number"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_employee_role",
          "name": "role",
          "display_name": "Role",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_employee_manager",
          "name": "manager",
          "display_name": "Manager",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_employee_active",
          "name": "active",
          "display_name": "Active",
          "type": {
            "kind": "base",
            "name": "boolean"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_employee_employee_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_inventory_item",
      "name": "InventoryItem",
      "display_name": "Inventory Item",
      "fields": [
        {
          "id": "fld_inventory_item_inventory_item_id",
          "name": "inventory_item_id",
          "display_name": "Inventory Item ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_inventory_item_product",
          "name": "product",
          "display_name": "Product",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_product"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_quantity_on_hand",
          "name": "quantity_on_hand",
          "display_name": "Quantity On Hand",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_reorder_threshold",
          "name": "reorder_threshold",
          "display_name": "Reorder Threshold",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_reorder_quantity",
          "name": "reorder_quantity",
          "display_name": "Reorder Quantity",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_location_code",
          "name": "location_code",
          "display_name": "Location Code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_lot_code",
          "name": "lot_code",
          "display_name": "Lot Code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_expires_on",
          "name": "expires_on",
          "display_name": "Expires On",
          "type": {
            "kind": "base",
            "name": "date"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_last_restocked_at",
          "name": "last_restocked_at",
          "display_name": "Last Restocked At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_inventory_item_inventory_item_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_invoice",
      "name": "Invoice",
      "display_name": "Invoice",
      "fields": [
        {
          "id": "fld_invoice_invoice_id",
          "name": "invoice_id",
          "display_name": "Invoice ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_invoice_sales_order",
          "name": "sales_order",
          "display_name": "Sales Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_issued_at",
          "name": "issued_at",
          "display_name": "Issued At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_due_on",
          "name": "due_on",
          "display_name": "Due On",
          "type": {
            "kind": "base",
            "name": "date"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_subtotal",
          "name": "subtotal",
          "display_name": "Subtotal",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_tax_amount",
          "name": "tax_amount",
          "display_name": "Tax Amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_total_due",
          "name": "total_due",
          "display_name": "Total Due",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_balance_due",
          "name": "balance_due",
          "display_name": "Balance Due",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_currency",
          "name": "currency",
          "display_name": "Currency",
          "type": {
            "kind": "custom",
            "target_type_id": "type_currency_code"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_invoice_invoice_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_invoice_issued",
          "name": "issued",
          "display_name": "Issued",
          "initial": true
        },
        {
          "id": "state_invoice_paid",
          "name": "paid",
          "display_name": "Paid",
          "initial": false
        },
        {
          "id": "state_invoice_overdue",
          "name": "overdue",
          "display_name": "Overdue",
          "initial": false
        }
      ],
      "transitions": [
        {
          "id": "trans_invoice_mark_paid",
          "name": "markPaid",
          "display_name": "Mark Paid",
          "from_state_id": "state_invoice_issued",
          "to_state_id": "state_invoice_paid"
        },
        {
          "id": "trans_invoice_mark_overdue",
          "name": "markOverdue",
          "display_name": "Mark Overdue",
          "from_state_id": "state_invoice_issued",
          "to_state_id": "state_invoice_overdue"
        }
      ]
    },
    {
      "id": "obj_product",
      "name": "Product",
      "display_name": "Product",
      "fields": [
        {
          "id": "fld_product_product_id",
          "name": "product_id",
          "display_name": "Product ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_product_sku",
          "name": "sku",
          "display_name": "SKU",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "display"
        },
        {
          "id": "fld_product_name",
          "name": "name",
          "display_name": "Name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "display"
        },
        {
          "id": "fld_product_description",
          "name": "description",
          "display_name": "Description",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_product_supplier",
          "name": "supplier",
          "display_name": "Supplier",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_supplier"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_product_list_price",
          "name": "list_price",
          "display_name": "List Price",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_product_cost_price",
          "name": "cost_price",
          "display_name": "Cost Price",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_product_active",
          "name": "active",
          "display_name": "Active",
          "type": {
            "kind": "base",
            "name": "boolean"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_product_tags",
          "name": "tags",
          "display_name": "Tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_product_product_id"
          ]
        },
        "display": {
          "field_ids": [
            "fld_product_sku",
            "fld_product_name"
          ]
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_purchase_order",
      "name": "PurchaseOrder",
      "display_name": "Purchase Order",
      "fields": [
        {
          "id": "fld_purchase_order_purchase_order_id",
          "name": "purchase_order_id",
          "display_name": "Purchase Order ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_purchase_order_supplier",
          "name": "supplier",
          "display_name": "Supplier",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_supplier"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_requested_by",
          "name": "requested_by",
          "display_name": "Requested By",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_lines",
          "name": "lines",
          "display_name": "Lines",
          "type": {
            "kind": "list",
            "element": {
              "kind": "struct",
              "target_struct_id": "struct_purchase_order_line"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        },
        {
          "id": "fld_purchase_order_notes",
          "name": "notes",
          "display_name": "Notes",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_submitted_at",
          "name": "submitted_at",
          "display_name": "Submitted At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_received_at",
          "name": "received_at",
          "display_name": "Received At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_total_cost",
          "name": "total_cost",
          "display_name": "Total Cost",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_purchase_order_purchase_order_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_purchase_order_draft",
          "name": "draft",
          "display_name": "Draft",
          "initial": true
        },
        {
          "id": "state_purchase_order_submitted",
          "name": "submitted",
          "display_name": "Submitted",
          "initial": false
        },
        {
          "id": "state_purchase_order_received",
          "name": "received",
          "display_name": "Received",
          "initial": false
        },
        {
          "id": "state_purchase_order_closed",
          "name": "closed",
          "display_name": "Closed",
          "initial": false
        }
      ],
      "transitions": [
        {
          "id": "trans_purchase_order_submit",
          "name": "submit",
          "display_name": "Submit",
          "from_state_id": "state_purchase_order_draft",
          "to_state_id": "state_purchase_order_submitted"
        },
        {
          "id": "trans_purchase_order_receive",
          "name": "receive",
          "display_name": "Receive",
          "from_state_id": "state_purchase_order_submitted",
          "to_state_id": "state_purchase_order_received"
        },
        {
          "id": "trans_purchase_order_close",
          "name": "close",
          "display_name": "Close",
          "from_state_id": "state_purchase_order_received",
          "to_state_id": "state_purchase_order_closed"
        }
      ]
    },
    {
      "id": "obj_sales_order",
      "name": "SalesOrder",
      "display_name": "Sales Order",
      "fields": [
        {
          "id": "fld_sales_order_sales_order_id",
          "name": "sales_order_id",
          "display_name": "Sales Order ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_sales_order_customer",
          "name": "customer",
          "display_name": "Customer",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_customer"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_created_by",
          "name": "created_by",
          "display_name": "Created By",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_lines",
          "name": "lines",
          "display_name": "Lines",
          "type": {
            "kind": "list",
            "element": {
              "kind": "struct",
              "target_struct_id": "struct_sales_order_line"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        },
        {
          "id": "fld_sales_order_requested_fulfillment_date",
          "name": "requested_fulfillment_date",
          "display_name": "Requested Fulfillment Date",
          "type": {
            "kind": "base",
            "name": "date"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_subtotal",
          "name": "subtotal",
          "display_name": "Subtotal",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_tax_amount",
          "name": "tax_amount",
          "display_name": "Tax Amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_total_amount",
          "name": "total_amount",
          "display_name": "Total Amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_invoice",
          "name": "invoice",
          "display_name": "Invoice",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_invoice"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_notes",
          "name": "notes",
          "display_name": "Notes",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_sales_order_sales_order_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_sales_order_pending_payment",
          "name": "pending_payment",
          "display_name": "Pending Payment",
          "initial": true
        },
        {
          "id": "state_sales_order_paid",
          "name": "paid",
          "display_name": "Paid",
          "initial": false
        },
        {
          "id": "state_sales_order_fulfilled",
          "name": "fulfilled",
          "display_name": "Fulfilled",
          "initial": false
        },
        {
          "id": "state_sales_order_cancelled",
          "name": "cancelled",
          "display_name": "Cancelled",
          "initial": false
        }
      ],
      "transitions": [
        {
          "id": "trans_sales_order_mark_paid",
          "name": "markPaid",
          "display_name": "Mark Paid",
          "from_state_id": "state_sales_order_pending_payment",
          "to_state_id": "state_sales_order_paid"
        },
        {
          "id": "trans_sales_order_fulfill",
          "name": "fulfill",
          "display_name": "Fulfill",
          "from_state_id": "state_sales_order_paid",
          "to_state_id": "state_sales_order_fulfilled"
        },
        {
          "id": "trans_sales_order_cancel",
          "name": "cancel",
          "display_name": "Cancel",
          "from_state_id": "state_sales_order_pending_payment",
          "to_state_id": "state_sales_order_cancelled"
        }
      ]
    },
    {
      "id": "obj_supplier",
      "name": "Supplier",
      "display_name": "Supplier",
      "fields": [
        {
          "id": "fld_supplier_supplier_id",
          "name": "supplier_id",
          "display_name": "Supplier ID",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_supplier_legal_name",
          "name": "legal_name",
          "display_name": "Legal Name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_supplier_primary_contact",
          "name": "primary_contact",
          "display_name": "Primary Contact",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_contact_point"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_supplier_payment_terms_days",
          "name": "payment_terms_days",
          "display_name": "Payment Terms Days",
          "type": {
            "kind": "base",
            "name": "int"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_supplier_address",
          "name": "address",
          "display_name": "Address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_supplier_active",
          "name": "active",
          "display_name": "Active",
          "type": {
            "kind": "base",
            "name": "boolean"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_supplier_supplier_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    }
  ],
  "structs": [
    {
      "id": "struct_address",
      "name": "Address",
      "display_name": "Address",
      "fields": [
        {
          "id": "fld_struct_address_line1",
          "name": "line1",
          "display_name": "Line 1",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_line2",
          "name": "line2",
          "display_name": "Line 2",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_city",
          "name": "city",
          "display_name": "City",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_region",
          "name": "region",
          "display_name": "Region",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_postal_code",
          "name": "postal_code",
          "display_name": "Postal Code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_country_code",
          "name": "country_code",
          "display_name": "Country Code",
          "type": {
            "kind": "custom",
            "target_type_id": "type_currency_code"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_contact_point",
      "name": "ContactPoint",
      "display_name": "Contact Point",
      "fields": [
        {
          "id": "fld_struct_contact_point_name",
          "name": "name",
          "display_name": "Name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_contact_point_email",
          "name": "email",
          "display_name": "Email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_contact_point_phone",
          "name": "phone",
          "display_name": "Phone",
          "type": {
            "kind": "custom",
            "target_type_id": "type_phone_number"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_payment_method_details",
      "name": "PaymentMethodDetails",
      "display_name": "Payment Method Details",
      "fields": [
        {
          "id": "fld_struct_payment_method_details_method",
          "name": "method",
          "display_name": "Method",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_payment_method_details_provider_reference",
          "name": "provider_reference",
          "display_name": "Provider Reference",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_payment_method_details_note",
          "name": "note",
          "display_name": "Note",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_purchase_order_line",
      "name": "PurchaseOrderLine",
      "display_name": "Purchase Order Line",
      "fields": [
        {
          "id": "fld_struct_purchase_order_line_product",
          "name": "product",
          "display_name": "Product",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_product"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_purchase_order_line_quantity",
          "name": "quantity",
          "display_name": "Quantity",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_purchase_order_line_unit_cost",
          "name": "unit_cost",
          "display_name": "Unit Cost",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_sales_order_line",
      "name": "SalesOrderLine",
      "display_name": "Sales Order Line",
      "fields": [
        {
          "id": "fld_struct_sales_order_line_product",
          "name": "product",
          "display_name": "Product",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_product"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_sales_order_line_quantity",
          "name": "quantity",
          "display_name": "Quantity",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_sales_order_line_unit_price",
          "name": "unit_price",
          "display_name": "Unit Price",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_sales_order_line_note",
          "name": "note",
          "display_name": "Note",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    }
  ],
  "action_inputs": [
    {
      "id": "ain_adjust_inventory",
      "name": "AdjustInventoryCommand",
      "display_name": "AdjustInventoryCommand",
      "fields": [
        {
          "id": "fld_ain_adjust_inventory_inventory_item",
          "name": "inventoryItem",
          "display_name": "Inventory Item",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_inventory_item"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_adjust_inventory_delta",
          "name": "delta",
          "display_name": "Delta",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_adjust_inventory_reason",
          "name": "reason",
          "display_name": "Reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_cancel_sales_order",
      "name": "CancelSalesOrderCommand",
      "display_name": "CancelSalesOrderCommand",
      "fields": [
        {
          "id": "fld_ain_cancel_sales_order_sales_order",
          "name": "salesOrder",
          "display_name": "Sales Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_cancel_sales_order_reason",
          "name": "reason",
          "display_name": "Reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_cancel_sales_order_cancelled_at",
          "name": "cancelledAt",
          "display_name": "Cancelled At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_close_purchase_order",
      "name": "ClosePurchaseOrderCommand",
      "display_name": "ClosePurchaseOrderCommand",
      "fields": [
        {
          "id": "fld_ain_close_purchase_order_purchase_order",
          "name": "purchaseOrder",
          "display_name": "Purchase Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_purchase_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_close_purchase_order_closed_at",
          "name": "closedAt",
          "display_name": "Closed At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_create_purchase_order",
      "name": "CreatePurchaseOrderCommand",
      "display_name": "CreatePurchaseOrderCommand",
      "fields": [
        {
          "id": "fld_ain_create_purchase_order_supplier",
          "name": "supplier",
          "display_name": "Supplier",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_supplier"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_purchase_order_requested_by",
          "name": "requestedBy",
          "display_name": "Requested By",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_purchase_order_lines",
          "name": "lines",
          "display_name": "Lines",
          "type": {
            "kind": "list",
            "element": {
              "kind": "struct",
              "target_struct_id": "struct_purchase_order_line"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        },
        {
          "id": "fld_ain_create_purchase_order_notes",
          "name": "notes",
          "display_name": "Notes",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_create_sales_order",
      "name": "CreateSalesOrderCommand",
      "display_name": "CreateSalesOrderCommand",
      "fields": [
        {
          "id": "fld_ain_create_sales_order_customer",
          "name": "customer",
          "display_name": "Customer",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_customer"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_sales_order_created_by",
          "name": "createdBy",
          "display_name": "Created By",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_sales_order_lines",
          "name": "lines",
          "display_name": "Lines",
          "type": {
            "kind": "list",
            "element": {
              "kind": "struct",
              "target_struct_id": "struct_sales_order_line"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        },
        {
          "id": "fld_ain_create_sales_order_requested_fulfillment_date",
          "name": "requestedFulfillmentDate",
          "display_name": "Requested Fulfillment Date",
          "type": {
            "kind": "base",
            "name": "date"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_fulfill_sales_order",
      "name": "FulfillSalesOrderCommand",
      "display_name": "FulfillSalesOrderCommand",
      "fields": [
        {
          "id": "fld_ain_fulfill_sales_order_sales_order",
          "name": "salesOrder",
          "display_name": "Sales Order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_fulfill_sales_order_fulfilled_at",
          "name": "fulfilledAt",
          "display_name": "Fulfilled At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_fulfill_sales_order_shipment_tracking",
          "name": "shipmentTracking",
          "display_name": "Shipment Tracking",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_mark_invoice_overdue",
      "name": "MarkInvoiceOverdueCommand",
      "display_name": "MarkInvoiceOverdueCommand",
      "fields": [
        {
          "id": "fld_ain_mark_invoice_overdue_invoice",
          "name": "invoice",
          "display_name": "Invoice",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_invoice"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_mark_invoice_overdue_marked_at",
          "name": "markedAt",
          "display_name": "Marked At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_mark_invoice_paid",
      "name": "MarkInvoicePaidCommand",
      "display_name": "MarkInvoicePaidCommand",
      "fields": [
        {
          "id": "fld_ain_mark_invoice_paid_invoice",
          "name": "invoice",
          "display_name": "Invoice",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_invoice"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_mark_invoice_paid_paid_at",
          "name": "paidAt",
          "display_name": "Paid At",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_mark_invoice_paid_payment_reference",
          "name": "paymentReference",
          "display_name": "Payment Reference",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_mark_sales_order_paid",
      "name": "MarkSalesOrderPaidCommand",
      "display_name": "MarkSalesOrderPaidCommand",
      "fields": [
        {
