{
  "ir_version": "0.1",
  "toolchain_version": "0.20.0",
  "ontology_source_file": "ontology/local/main.prophet",
  "ontology": {
    "id": "ont_artisan_bakery_local",
    "name": "artisan_bakery_local",
    "version": "1.0.0",
    "description": "Operations ontology for a neighborhood bakery: catalog, customers, inventory, purchasing, invoicing, and fulfillment."
  },
  "types": [
    {
      "id": "type_currency_code",
      "name": "CurrencyCode",
      "kind": "custom",
      "base": "string",
      "constraints": {
        "pattern": "^[A-Z]{3}$"
      }
    },
    {
      "id": "type_email",
      "name": "Email",
      "kind": "custom",
      "base": "string",
      "constraints": {
        "pattern": "^[^@\\\\s]+@[^@\\\\s]+\\\\.[^@\\\\s]+$"
      }
    },
    {
      "id": "type_money",
      "name": "Money",
      "kind": "custom",
      "base": "decimal",
      "constraints": {
        "min": "0.00"
      }
    },
    {
      "id": "type_phone_number",
      "name": "PhoneNumber",
      "kind": "custom",
      "base": "string",
      "constraints": {
        "pattern": "^\\\\+?[0-9][0-9\\\\- ]{7,19}$"
      }
    },
    {
      "id": "type_quantity",
      "name": "Quantity",
      "kind": "custom",
      "base": "decimal",
      "constraints": {
        "min": "0.00"
      }
    }
  ],
  "objects": [
    {
      "id": "obj_customer",
      "name": "Customer",
      "fields": [
        {
          "id": "fld_customer_customer_id",
          "name": "customer_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_customer_full_name",
          "name": "full_name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_customer_email",
          "name": "email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_phone",
          "name": "phone",
          "type": {
            "kind": "custom",
            "target_type_id": "type_phone_number"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_billing_address",
          "name": "billing_address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_shipping_address",
          "name": "shipping_address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_preferred_currency",
          "name": "preferred_currency",
          "type": {
            "kind": "custom",
            "target_type_id": "type_currency_code"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_loyalty_points",
          "name": "loyalty_points",
          "type": {
            "kind": "base",
            "name": "int"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_customer_tags",
          "name": "tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_customer_customer_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_delivery",
      "name": "Delivery",
      "fields": [
        {
          "id": "fld_delivery_delivery_id",
          "name": "delivery_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_delivery_sales_order",
          "name": "sales_order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_destination",
          "name": "destination",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_carrier",
          "name": "carrier",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_tracking_number",
          "name": "tracking_number",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_scheduled_for",
          "name": "scheduled_for",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_delivered_at",
          "name": "delivered_at",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_delivery_status_text",
          "name": "status_text",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_delivery_delivery_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_employee",
      "name": "Employee",
      "fields": [
        {
          "id": "fld_employee_employee_id",
          "name": "employee_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_employee_full_name",
          "name": "full_name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_employee_email",
          "name": "email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_employee_phone",
          "name": "phone",
          "type": {
            "kind": "custom",
            "target_type_id": "type_phone_number"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_employee_role",
          "name": "role",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_employee_manager",
          "name": "manager",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_employee_active",
          "name": "active",
          "type": {
            "kind": "base",
            "name": "boolean"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_employee_employee_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_inventory_item",
      "name": "InventoryItem",
      "fields": [
        {
          "id": "fld_inventory_item_inventory_item_id",
          "name": "inventory_item_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_inventory_item_product",
          "name": "product",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_product"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_quantity_on_hand",
          "name": "quantity_on_hand",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_reorder_threshold",
          "name": "reorder_threshold",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_reorder_quantity",
          "name": "reorder_quantity",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_location_code",
          "name": "location_code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_lot_code",
          "name": "lot_code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_expires_on",
          "name": "expires_on",
          "type": {
            "kind": "base",
            "name": "date"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_inventory_item_last_restocked_at",
          "name": "last_restocked_at",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_inventory_item_inventory_item_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_invoice",
      "name": "Invoice",
      "fields": [
        {
          "id": "fld_invoice_invoice_id",
          "name": "invoice_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_invoice_sales_order",
          "name": "sales_order",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_issued_at",
          "name": "issued_at",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_due_on",
          "name": "due_on",
          "type": {
            "kind": "base",
            "name": "date"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_subtotal",
          "name": "subtotal",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_tax_amount",
          "name": "tax_amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_total_due",
          "name": "total_due",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_balance_due",
          "name": "balance_due",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_invoice_currency",
          "name": "currency",
          "type": {
            "kind": "custom",
            "target_type_id": "type_currency_code"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_invoice_invoice_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_invoice_issued",
          "name": "issued",
          "initial": true
        },
        {
          "id": "state_invoice_paid",
          "name": "paid",
          "initial": false
        },
        {
          "id": "state_invoice_overdue",
          "name": "overdue",
          "initial": false
        }
      ],
      "transitions": [
        {
          "id": "trans_invoice_mark_paid",
          "name": "markPaid",
          "from_state_id": "state_invoice_issued",
          "to_state_id": "state_invoice_paid"
        },
        {
          "id": "trans_invoice_mark_overdue",
          "name": "markOverdue",
          "from_state_id": "state_invoice_issued",
          "to_state_id": "state_invoice_overdue"
        }
      ]
    },
    {
      "id": "obj_product",
      "name": "Product",
      "fields": [
        {
          "id": "fld_product_product_id",
          "name": "product_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_product_sku",
          "name": "sku",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "display"
        },
        {
          "id": "fld_product_name",
          "name": "name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "display"
        },
        {
          "id": "fld_product_description",
          "name": "description",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_product_supplier",
          "name": "supplier",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_supplier"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_product_list_price",
          "name": "list_price",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_product_cost_price",
          "name": "cost_price",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_product_active",
          "name": "active",
          "type": {
            "kind": "base",
            "name": "boolean"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_product_tags",
          "name": "tags",
          "type": {
            "kind": "list",
            "element": {
              "kind": "base",
              "name": "string"
            }
          },
          "cardinality": {
            "min": 0,
            "max": "many"
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_product_product_id"
          ]
        },
        "display": {
          "field_ids": [
            "fld_product_sku",
            "fld_product_name"
          ]
        }
      },
      "states": [],
      "transitions": []
    },
    {
      "id": "obj_purchase_order",
      "name": "PurchaseOrder",
      "fields": [
        {
          "id": "fld_purchase_order_purchase_order_id",
          "name": "purchase_order_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_purchase_order_supplier",
          "name": "supplier",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_supplier"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_requested_by",
          "name": "requested_by",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_lines",
          "name": "lines",
          "type": {
            "kind": "list",
            "element": {
              "kind": "struct",
              "target_struct_id": "struct_purchase_order_line"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        },
        {
          "id": "fld_purchase_order_notes",
          "name": "notes",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_submitted_at",
          "name": "submitted_at",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_received_at",
          "name": "received_at",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_purchase_order_total_cost",
          "name": "total_cost",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_purchase_order_purchase_order_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_purchase_order_draft",
          "name": "draft",
          "initial": true
        },
        {
          "id": "state_purchase_order_submitted",
          "name": "submitted",
          "initial": false
        },
        {
          "id": "state_purchase_order_received",
          "name": "received",
          "initial": false
        },
        {
          "id": "state_purchase_order_closed",
          "name": "closed",
          "initial": false
        }
      ],
      "transitions": [
        {
          "id": "trans_purchase_order_submit",
          "name": "submit",
          "from_state_id": "state_purchase_order_draft",
          "to_state_id": "state_purchase_order_submitted"
        },
        {
          "id": "trans_purchase_order_receive",
          "name": "receive",
          "from_state_id": "state_purchase_order_submitted",
          "to_state_id": "state_purchase_order_received"
        },
        {
          "id": "trans_purchase_order_close",
          "name": "close",
          "from_state_id": "state_purchase_order_received",
          "to_state_id": "state_purchase_order_closed"
        }
      ]
    },
    {
      "id": "obj_sales_order",
      "name": "SalesOrder",
      "fields": [
        {
          "id": "fld_sales_order_sales_order_id",
          "name": "sales_order_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_sales_order_customer",
          "name": "customer",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_customer"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_created_by",
          "name": "created_by",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_lines",
          "name": "lines",
          "type": {
            "kind": "list",
            "element": {
              "kind": "struct",
              "target_struct_id": "struct_sales_order_line"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        },
        {
          "id": "fld_sales_order_requested_fulfillment_date",
          "name": "requested_fulfillment_date",
          "type": {
            "kind": "base",
            "name": "date"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_subtotal",
          "name": "subtotal",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_tax_amount",
          "name": "tax_amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_total_amount",
          "name": "total_amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_invoice",
          "name": "invoice",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_invoice"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_sales_order_notes",
          "name": "notes",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_sales_order_sales_order_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [
        {
          "id": "state_sales_order_pending_payment",
          "name": "pending_payment",
          "initial": true
        },
        {
          "id": "state_sales_order_paid",
          "name": "paid",
          "initial": false
        },
        {
          "id": "state_sales_order_fulfilled",
          "name": "fulfilled",
          "initial": false
        },
        {
          "id": "state_sales_order_cancelled",
          "name": "cancelled",
          "initial": false
        }
      ],
      "transitions": [
        {
          "id": "trans_sales_order_mark_paid",
          "name": "markPaid",
          "from_state_id": "state_sales_order_pending_payment",
          "to_state_id": "state_sales_order_paid"
        },
        {
          "id": "trans_sales_order_fulfill",
          "name": "fulfill",
          "from_state_id": "state_sales_order_paid",
          "to_state_id": "state_sales_order_fulfilled"
        },
        {
          "id": "trans_sales_order_cancel",
          "name": "cancel",
          "from_state_id": "state_sales_order_pending_payment",
          "to_state_id": "state_sales_order_cancelled"
        }
      ]
    },
    {
      "id": "obj_supplier",
      "name": "Supplier",
      "fields": [
        {
          "id": "fld_supplier_supplier_id",
          "name": "supplier_id",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          },
          "key": "primary"
        },
        {
          "id": "fld_supplier_legal_name",
          "name": "legal_name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_supplier_primary_contact",
          "name": "primary_contact",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_contact_point"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_supplier_payment_terms_days",
          "name": "payment_terms_days",
          "type": {
            "kind": "base",
            "name": "int"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_supplier_address",
          "name": "address",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_supplier_active",
          "name": "active",
          "type": {
            "kind": "base",
            "name": "boolean"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ],
      "keys": {
        "primary": {
          "field_ids": [
            "fld_supplier_supplier_id"
          ]
        },
        "display": {
          "field_ids": []
        }
      },
      "states": [],
      "transitions": []
    }
  ],
  "structs": [
    {
      "id": "struct_address",
      "name": "Address",
      "fields": [
        {
          "id": "fld_struct_address_line1",
          "name": "line1",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_line2",
          "name": "line2",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_city",
          "name": "city",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_region",
          "name": "region",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_postal_code",
          "name": "postal_code",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_address_country_code",
          "name": "country_code",
          "type": {
            "kind": "custom",
            "target_type_id": "type_currency_code"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_contact_point",
      "name": "ContactPoint",
      "fields": [
        {
          "id": "fld_struct_contact_point_name",
          "name": "name",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_contact_point_email",
          "name": "email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_contact_point_phone",
          "name": "phone",
          "type": {
            "kind": "custom",
            "target_type_id": "type_phone_number"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_payment_method_details",
      "name": "PaymentMethodDetails",
      "fields": [
        {
          "id": "fld_struct_payment_method_details_method",
          "name": "method",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_payment_method_details_provider_reference",
          "name": "provider_reference",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_struct_payment_method_details_note",
          "name": "note",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_purchase_order_line",
      "name": "PurchaseOrderLine",
      "fields": [
        {
          "id": "fld_struct_purchase_order_line_product",
          "name": "product",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_product"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_purchase_order_line_quantity",
          "name": "quantity",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_purchase_order_line_unit_cost",
          "name": "unit_cost",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "struct_sales_order_line",
      "name": "SalesOrderLine",
      "fields": [
        {
          "id": "fld_struct_sales_order_line_product",
          "name": "product",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_product"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_sales_order_line_quantity",
          "name": "quantity",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_sales_order_line_unit_price",
          "name": "unit_price",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_struct_sales_order_line_note",
          "name": "note",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    }
  ],
  "action_inputs": [
    {
      "id": "ain_adjust_inventory",
      "name": "AdjustInventoryCommand",
      "fields": [
        {
          "id": "fld_ain_adjust_inventory_inventory_item",
          "name": "inventoryItem",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_inventory_item"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_adjust_inventory_delta",
          "name": "delta",
          "type": {
            "kind": "custom",
            "target_type_id": "type_quantity"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_adjust_inventory_reason",
          "name": "reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_cancel_sales_order",
      "name": "CancelSalesOrderCommand",
      "fields": [
        {
          "id": "fld_ain_cancel_sales_order_sales_order",
          "name": "salesOrder",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_cancel_sales_order_reason",
          "name": "reason",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_cancel_sales_order_cancelled_at",
          "name": "cancelledAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_close_purchase_order",
      "name": "ClosePurchaseOrderCommand",
      "fields": [
        {
          "id": "fld_ain_close_purchase_order_purchase_order",
          "name": "purchaseOrder",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_purchase_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_close_purchase_order_closed_at",
          "name": "closedAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_create_purchase_order",
      "name": "CreatePurchaseOrderCommand",
      "fields": [
        {
          "id": "fld_ain_create_purchase_order_supplier",
          "name": "supplier",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_supplier"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_purchase_order_requested_by",
          "name": "requestedBy",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_purchase_order_lines",
          "name": "lines",
          "type": {
            "kind": "list",
            "element": {
              "kind": "struct",
              "target_struct_id": "struct_purchase_order_line"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        },
        {
          "id": "fld_ain_create_purchase_order_notes",
          "name": "notes",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_create_sales_order",
      "name": "CreateSalesOrderCommand",
      "fields": [
        {
          "id": "fld_ain_create_sales_order_customer",
          "name": "customer",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_customer"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_sales_order_created_by",
          "name": "createdBy",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_employee"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_create_sales_order_lines",
          "name": "lines",
          "type": {
            "kind": "list",
            "element": {
              "kind": "struct",
              "target_struct_id": "struct_sales_order_line"
            }
          },
          "cardinality": {
            "min": 1,
            "max": "many"
          }
        },
        {
          "id": "fld_ain_create_sales_order_requested_fulfillment_date",
          "name": "requestedFulfillmentDate",
          "type": {
            "kind": "base",
            "name": "date"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_fulfill_sales_order",
      "name": "FulfillSalesOrderCommand",
      "fields": [
        {
          "id": "fld_ain_fulfill_sales_order_sales_order",
          "name": "salesOrder",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_fulfill_sales_order_fulfilled_at",
          "name": "fulfilledAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_fulfill_sales_order_shipment_tracking",
          "name": "shipmentTracking",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_mark_invoice_overdue",
      "name": "MarkInvoiceOverdueCommand",
      "fields": [
        {
          "id": "fld_ain_mark_invoice_overdue_invoice",
          "name": "invoice",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_invoice"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_mark_invoice_overdue_marked_at",
          "name": "markedAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_mark_invoice_paid",
      "name": "MarkInvoicePaidCommand",
      "fields": [
        {
          "id": "fld_ain_mark_invoice_paid_invoice",
          "name": "invoice",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_invoice"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_mark_invoice_paid_paid_at",
          "name": "paidAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_mark_invoice_paid_payment_reference",
          "name": "paymentReference",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_mark_sales_order_paid",
      "name": "MarkSalesOrderPaidCommand",
      "fields": [
        {
          "id": "fld_ain_mark_sales_order_paid_sales_order",
          "name": "salesOrder",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_sales_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_mark_sales_order_paid_amount",
          "name": "amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_mark_sales_order_paid_paid_at",
          "name": "paidAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_receive_purchase_order",
      "name": "ReceivePurchaseOrderCommand",
      "fields": [
        {
          "id": "fld_ain_receive_purchase_order_purchase_order",
          "name": "purchaseOrder",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_purchase_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_receive_purchase_order_received_at",
          "name": "receivedAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_receive_purchase_order_invoice_number",
          "name": "invoiceNumber",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_record_invoice_payment",
      "name": "RecordInvoicePaymentCommand",
      "fields": [
        {
          "id": "fld_ain_record_invoice_payment_invoice",
          "name": "invoice",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_invoice"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_record_invoice_payment_amount",
          "name": "amount",
          "type": {
            "kind": "custom",
            "target_type_id": "type_money"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_record_invoice_payment_method_details",
          "name": "methodDetails",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_payment_method_details"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_register_customer",
      "name": "RegisterCustomerCommand",
      "fields": [
        {
          "id": "fld_ain_register_customer_full_name",
          "name": "fullName",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_register_customer_email",
          "name": "email",
          "type": {
            "kind": "custom",
            "target_type_id": "type_email"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_ain_register_customer_phone",
          "name": "phone",
          "type": {
            "kind": "custom",
            "target_type_id": "type_phone_number"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_ain_register_customer_billing_address",
          "name": "billingAddress",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_ain_register_customer_shipping_address",
          "name": "shippingAddress",
          "type": {
            "kind": "struct",
            "target_struct_id": "struct_address"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        },
        {
          "id": "fld_ain_register_customer_preferred_currency",
          "name": "preferredCurrency",
          "type": {
            "kind": "custom",
            "target_type_id": "type_currency_code"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_restock_inventory",
      "name": "RestockInventoryCommand",
      "fields": [
        {
          "id": "fld_ain_restock_inventory_purchase_order",
          "name": "purchaseOrder",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_purchase_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_restock_inventory_received_at",
          "name": "receivedAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        }
      ]
    },
    {
      "id": "ain_submit_purchase_order",
      "name": "SubmitPurchaseOrderCommand",
      "fields": [
        {
          "id": "fld_ain_submit_purchase_order_purchase_order",
          "name": "purchaseOrder",
          "type": {
            "kind": "object_ref",
            "target_object_id": "obj_purchase_order"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_submit_purchase_order_submitted_at",
          "name": "submittedAt",
          "type": {
            "kind": "base",
            "name": "datetime"
          },
          "cardinality": {
            "min": 1,
            "max": 1
          }
        },
        {
          "id": "fld_ain_submit_purchase_order_buyer_note",
          "name": "buyerNote",
          "type": {
            "kind": "base",
            "name": "string"
          },
          "cardinality": {
            "min": 0,
            "max": 1
          }
